Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: Preprocess a single C/C++ source file, named in *source*. Output will be written to file named *output_file*, or *stdout* if *output_file* not supplied. *macros* is a list of macro definitions as for :meth:`compile`, which will augment the macros set with :meth:`define_macro` and :meth:`undefine_macro`. *include_dirs* is a list of directory names that will be added to the default list, in the same way as :meth:`add_include_dir`.
pl: Przygotuj wstępnie pojedynczy plik źródłowy C/C++ którego nazwa jest wymieniona w *source*. Wynik zostanie wpisany do pliku nazwanego *output_file*, lub *stdout* jeśli *output_file* nie został dostarczony. *macros* jest listą makrodefinicji, jak dla :meth:`compile`, który wzbogaca zbiór makr o :meth:`define_macro` i :meth:`undefine_macro`. *include_dirs* jest listą nazw katalogów, które będą dodane do listy domyślnej, w ten sam sposób jak przy użyciu sposobu postępowania :meth:`add_include_dir`.

source: Raises :exc:`PreprocessError` on failure.
pl: Zgłasza :exc:`PreprocessorError` w przypadku błędu.

source: The following utility methods are defined by the :class:`CCompiler` class, for use by the various concrete subclasses.
pl: Następujące sposoby postępowania pomocnicze są zdefiniowane przez uogólnienie :class:`CCompiler`, dla użycia przez różne konkretne uogólnienia podrzędne.

source: Returns the filename of the executable for the given *basename*. Typically for non-Windows platforms this is the same as the basename, while Windows will get a :file:`.exe` added.
pl: Zwraca nazwę pliku wykonywalnego dla danego *basename* - *nazwy podstawowej*. Typowo dla nie-Windowsowych maszyn/środowisk to jest tak samo jak nazwa podstawowa, podczas gdy Windows dostanie :file:`.exe` dodatkowo.

source: Returns the filename for the given library name on the current platform. On Unix a library with *lib_type* of ``'static'`` will typically be of the form :file:`liblibname.a`, while a *lib_type* of ``'dynamic'`` will be of the form :file:`liblibname.so`.
pl: Zwraca nazwę pliku dla danej nazwy biblioteki na aktualnej maszynie/środowisku. Na Unixie biblioteka o *lib_type* ``'static'`` ( - z ang. - statycznej ) będzie w formie :file:`liblibname.a`, podczas gdy *lib_type* ``'dynamic'`` będzie w formie :file:`liblibname.so`.

source: Returns the name of the object files for the given source files. *source_filenames* should be a list of filenames.
pl: Zwraca nazwę pliku przedmiotów dla danych plików źródłowych. *source_filenames* powinno być listą nazw plików.

source: Returns the name of a shared object file for the given file name *basename*.
pl: Zwraca nazwę pliku współdzielonych przedmiotów dla danych nazw plików *basename*.

source: Invokes :func:`distutils.util.execute` This method invokes a Python function *func* with the given arguments *args*, after logging and taking into account the *dry_run* flag. XXX see also.
pl: Wywołuje zadanie :func:`distutils.util.execute`. Ten sposób postępowania wywołuje zadanie języka pytonowskiego *func* z danymi parametrami *args*, po logowaniu i wzięciu pod uwagę flagi *dry_run*. XXX Zob. też.

source: Invokes :func:`distutils.util.spawn`. This invokes an external process to run the given command. XXX see also.
pl: Wywołuje zadanie :func:`distutils.util.spawn`. To wzywa zewnętrzny proces do wywołania danej komendy. XXX Zob. też.

source: Invokes :func:`distutils.dir_util.mkpath`. This creates a directory and any missing ancestor directories. XXX see also.
pl: Wywołuje :func:`distutils.dir_util.mkpath`. To tworzy katalog i wszystkie brakujące katalogi nadrzędne. XXX Zob. też.

source: Invokes :meth:`distutils.file_util.move_file`. Renames *src* to *dst*. XXX see also.
pl: Wywołuje sposób postępowania :meth:`distutils.file_util.move_file` Zmienia nazwę z *src* ( - z ang. - źródło ) do *dst* ( - z ang. - cel ). XXX Zob. też.

source: Write a message using :func:`distutils.log.debug`. XXX see also.
pl: Zapisz wiadomość używając zadania :func:`distutils.log.debug`. XXX Zob. też.

source: Write a warning message *msg* to standard error.
pl: Wypisz wiadomość ostrzeżenia *msg* na standardowe wyjście błędów.

source: If the *debug* flag is set on this :class:`CCompiler` instance, print *msg* to standard output, otherwise do nothing.
pl: Jeśli flaga *debug* jest ustawiona w tym przykładzie :class:`CCompiler`, wypisz *msg* na standardowe wyjście, w przeciwnym razie nie rób nic.

source: :mod:`distutils.unixccompiler` --- Unix C Compiler
pl: :mod:`distutils.unixccompiler` --- kompilator C Unixa

source: This module provides the :class:`UnixCCompiler` class, a subclass of :class:`CCompiler` that handles the typical Unix-style command-line C compiler:
pl: Ten moduł dostarcza uogólnienie :class:`UnixCCompiler`, uogólnienie podrzędne względem uogólnienia :class:`CCompiler` który obsługuje typowy kompilator języka C wiersza polecenia w stylu Unixowym.

source: macros defined with :option:`-Dname[=value]`
pl: makrodefinicje określone z opcją :option:`-Dname[=value]`

source: macros undefined with :option:`-Uname`
pl: makrodefinicje których definicja została odwołana opcją :option:`-Uname`

source: include search directories specified with :option:`-Idir`
pl: załączony katalog poszukiwania plików nagłówkowych określony z opcją :option:`-Idir`

source: libraries specified with :option:`-llib`
pl: biblioteki określone z opcją :option:`-llib`

source: library search directories specified with :option:`-Ldir`
pl: katalogi do przeszukania na obecność bibliotek określone z opcją :option:`-Ldir`

source: compile handled by :program:`cc` (or similar) executable with :option:`-c` option: compiles :file:`.c` to :file:`.o`
pl: kompilacja obsługiwana przez :program:`cc` (lub podobny) wykonywalny z opcją :option:`-c`: kompiluje plik :file:`.c` do pliku :file:`.o`

source: link static library handled by :program:`ar` command (possibly with :program:`ranlib`)
pl: podłącz statyczną bibliotekę obsługiwane przez komendę :program:`ar` (możliwie z programem :program:`ranlib`)

source: link shared library handled by :program:`cc` :option:`-shared`
pl: podłącz współdzieloną bibliotekę obsługiwaną przez program :program:`cc` z opcją :option:`-shared`

source: :mod:`distutils.msvccompiler` --- Microsoft Compiler
pl: moduł :mod:`distutils.msvccompiler` --- Kompilator Microsoftu

source: This module provides :class:`MSVCCompiler`, an implementation of the abstract :class:`CCompiler` class for Microsoft Visual Studio. Typically, extension modules need to be compiled with the same compiler that was used to compile Python. For Python 2.3 and earlier, the compiler was Visual Studio 6. For Python 2.4 and 2.5, the compiler is Visual Studio .NET 2003. The AMD64 and Itanium binaries are created using the Platform SDK.
pl: Ten moduł dostarcza uogólnienie :class:MSVCCompiler`, wypełnienie abstrakcyjnych uogólnień dla Microsoft Visual Studio. Typowo moduły rozszerzające wymagają kompilacji przez ten sam kompilator który był użyty do kompilacji języka pytonowskiego. Dla języka pytonowskiego 2.3 i wcześniejszych kompilatorem było Visual Studio 6. Dla języka pytonowskiego 2.4 i 2.5 kompilatorem było Visual Studio .NET 2003. Pliki wynikowe dla AMD64 i Itanium są tworzone używając Platformy SDK.

source: :class:`MSVCCompiler` will normally choose the right compiler, linker etc. on its own. To override this choice, the environment variables *DISTUTILS_USE_SDK* and *MSSdk* must be both set. *MSSdk* indicates that the current environment has been setup by the SDK's ``SetEnv.Cmd`` script, or that the environment variables had been registered when the SDK was installed; *DISTUTILS_USE_SDK* indicates that the distutils user has made an explicit choice to override the compiler selection by :class:`MSVCCompiler`.
pl: Uogólnienie :class:`MSVCCompiler` będzie zwykle wybierał właściwy kompilator i program łączący automatycznie. Aby obejść ten wybór, zmienne środowiskowe *DISTUTILS_USE_SDK* i *MSSdk* muszą obie być ustawione. *MSSdk* wskazuje, że obecne środowisko zostało ustawione przez skrypt ``SetEnv.Cmd`` należący do SDK (z ang. zestaw rozwijania oprogramowania), lub że zmienne środowiskowe były zarejestrowane gdy SDK było instalowane; *DISTUTILS_USE_SDK* wskazuje że użytkownik distutils jawnie dokonał obejścia wyboru kompilatora przez uogólnienie :class:`MSVCCompiler`.

source: :mod:`distutils.bcppcompiler` --- Borland Compiler
pl: :mod:`distutils.bcppcompiler` --- Kompilator Borlanda

source: This module provides :class:`BorlandCCompiler`, an subclass of the abstract :class:`CCompiler` class for the Borland C++ compiler.
pl: Ten moduł dostarcza uogólnienie :class:`BorlandCCompiler`, jako podrzędne uogólnienie abstrakcyjnego uogólnienia :class:`CCompiler` dla kompilatora C++ firmy Borland.

source: :mod:`distutils.cygwincompiler` --- Cygwin Compiler
pl: :mod:`distutils.cygwincompiler` --- kompilator cygwina

source: This module provides the :class:`CygwinCCompiler` class, a subclass of :class:`UnixCCompiler` that handles the Cygwin port of the GNU C compiler to Windows. It also contains the Mingw32CCompiler class which handles the mingw32 port of GCC (same as cygwin in no-cygwin mode).
pl: Ten moduł dostarcza uogólnienie :class:`CygwinCCompiler`, podrzędne uogólnienie uogólnienia :class:`UnixCCompiler`, które obsługuje cygwinowski przekład kompilatora GNU C do Windows. Zawiera także uogólnienie Mingw32CCompiler które obsługuje przekład kompilatora GCC o nazwie mingw32 (taki sam jak cygwin w trybie no-cygwin).

source: :mod:`distutils.emxccompiler` --- OS/2 EMX Compiler
pl: :mod:`distutils.emxccompiler` --- kompilator OS/2 EMX

source: This module provides the EMXCCompiler class, a subclass of :class:`UnixCCompiler` that handles the EMX port of the GNU C compiler to OS/2.
pl: Ten moduł dostarcza uogólnienie EMXCCompiler, podrzędne uogólnienie uogólnienia :class:`UnixCCompiler` które obsługuje przekład EMX kompilatora GNU C na system OS/2.

source: :mod:`distutils.archive_util` --- Archiving utilities
pl: :mod:`distutils.archive_util` --- użytki archiwizujące

source: This module provides a few functions for creating archive files, such as tarballs or zipfiles.
pl: Ten moduł dostarcza kilku zadań do tworzenia plików archiwów, takich jak archiwa tar (z ang. tarball) lub pliki zip.

source: Create an archive file (eg. ``zip`` or ``tar``). *base_name* is the name of the file to create, minus any format-specific extension; *format* is the archive format: one of ``zip``, ``tar``, ``ztar``, or ``gztar``. *root_dir* is a directory that will be the root directory of the archive; ie. we typically ``chdir`` into *root_dir* before creating the archive. *base_dir* is the directory where we start archiving from; ie. *base_dir* will be the common prefix of all files and directories in the archive. *root_dir* and *base_dir* both default to the current directory. Returns the name of the archive file.
pl: Utwórz plik archiwum (np. ``zip`` lub ``tar``). *base_name* jest nazwą pliku do utworzenia bez uwzględniania szczególnych dla formatowania rozszerzeń; *format* jest formatem archiwum: jednym z ``zip``, ``tar``, lub ``gztar``. *root_dir* jest katalogiem który będzie nadrzędnym katalogiem archiwum; tj. często zmieniamy katalog (chdir - z ang. - polecenie zmiany katalogu) na *root_dir* przed utworzeniem archiwum. *base_dir* jest katalogiem gdzie zaczyna się archiwizacja; tj *base_dir* będzie wspólnym przedrostkiem wszystkich plików i katalogów w archiwum. *root_dir* i *base_dir* domyślnie są równe katalogowi bierzącemu. Zwraca nazwę pliku archiwum.

source: 'Create an (optional compressed) archive as a tar file from all files in and under *base_dir*. *compress* must be ``'gzip'`` (the default), ``'compress'``, ``'bzip2'``, or ``None``. Both :program:`tar` and the compression utility named by *compress* must be on the default program search path, so this is probably Unix-specific. The output tar file will be named :file:`base_dir.tar`, possibly plus the appropriate compression extension (:file:`.gz`, :file:`.bz2` or :file:`.Z`). Return the output filename.
pl: 'Stwórz (opcjonalnie skompresowane) archiwum jak plik tar ze wszystkich plików spod *base_dir*. *compress* musi być jednym z ``'gzip'`` (domyślne), ``'compress'``, ``'bzip2'`` lub ``żaden`` - z ang. - ``None``. Zarówno program :program:`tar` jak program użytkowy kompresji nazwany przez *compress* muszą być na domyślnej ścieżce poszukiwania programów, więc jest to raczej szczególne-dla-Unixa. Wynikowy plik tar zostanie nazwany :file:`base_dir.tar`, możliwe, że wraz z odpowiednim rozszerzeniem formatu kompresji (:file:`.gz`, :file:`.bz2` lub :file:`.Z`). Zwraca wynikową nazwę pliku.

source: Create a zip file from all files in and under *base_dir*. The output zip file will be named *base_dir* + :file:`.zip`. Uses either the :mod:`zipfile` Python module (if available) or the InfoZIP :file:`zip` utility (if installed and found on the default search path). If neither tool is available, raises :exc:`DistutilsExecError`. Returns the name of the output zip file.
pl: Stwórz plik zip ze wszystkich plików wewnątrz katalogu i podkatalogów *base_dir*. Wynikowy plik zip będzie nazwany *base_dir* + :file:`.zip` Używa modułu języka pytonowskiego :mod:`zipfile` (jeśli jest dostępny) lub programu zip ze zestawu InfoZIP (jeśli jest zainstalowany i znajduje się na domyślnej ścieżce poszukiwania). Jeśli żadne z narzędzi nie jest dostępne, zgłasza wyjątek :exc:`DistutilsExecError`. Zwraca nazwę wynikowego pliku zip.

source: :mod:`distutils.dep_util` --- Dependency checking
pl: :mod:`distutils.dep_util` --- sprawdzanie zależności

source: This module provides functions for performing simple, timestamp-based dependency of files and groups of files; also, functions based entirely on such timestamp dependency analysis.
pl: Ten moduł dostarcza zadań dla prowadzenia prostych opartych o stemple czasowe sprawdzania zależności między plikami i grupami plików; także funkcje oparte całkowicie o taką analizę zależności stempli czasowych.

source: Return true if *source* exists and is more recently modified than *target*, or if *source* exists and *target* doesn't. Return false if both exist and *target* is the same age or newer than *source*. Raise :exc:`DistutilsFileError` if *source* does not exist.
pl: Zwróć prawdę jeśli *źródło* - z ang. - *source* istnieje i zostało zmodyfikowanie bardziej niedawno niż *cel* - z ang. - *target* lub jeśli *source* istnieje a *target* nie. Zwróć fałsz jeśli oba istnieją, a *target* jest z tej samej daty/czasu lub nowsza niż *source*. Zgłasza :exc:`DistutilsFileError`, jeśli *source* nie istnieje.

source: Walk two filename lists in parallel, testing if each source is newer than its corresponding target. Return a pair of lists (*sources*, *targets*) where source is newer than target, according to the semantics of :func:`newer`
pl: Przejdź po dwóch listach nazw równolegle, testując czy każde źródło jest nowsze niż odpowiadający mu cel. Zwraca parę list (*źródła*,*cele*) gdzie źródła jest nowsze niż cel, zgodnie ze składnią :func:`newer` - z ang. - nowszy).

source: Return true if *target* is out-of-date with respect to any file listed in *sources* In other words, if *target* exists and is newer than every file in *sources*, return false; otherwise return true. *missing* controls what we do when a source file is missing; the default (``'error'``) is to blow up with an :exc:`OSError` from inside :func:`os.stat`; if it is ``'ignore'``, we silently drop any missing source files; if it is ``'newer'``, any missing source files make us assume that *target* is out-of-date (this is handy in "dry-run" mode: it'll make you pretend to carry out commands that wouldn't work because inputs are missing, but that doesn't matter because you're not actually going to run the commands).
pl: Zwróć prawdę jeśli *cel* jest nieaktualny względem dowolnego pliku na liście *sources*. Innymi słowy, jeśli *cel* istnieje i jest nowszy niż każdy plik wśród *źródeł*, zwróć fałsz; w innym przypadku zwróć prawdę; *missing* ( - z ang. - brakujący) kontroluje co zrobić gdy brakuje pliku wśród źródeł; domyślnym działaniem jest ``'error'`` ( - z ang. - błąd) wybuchnięcie z błędem :exc:`OSError` z wnętrza :func:`os.stat`; jeśli jest ``'ignore'``, po cichu pomijamy jakiekolwiek brakujące pliki; jeśli jest ``'newer'`` - z ang. - ``'nowsze'``, jakiekolwiek brakujące pliki źródłowe dają nam założenie, że *cel* - z ang. *target* jest nieaktualny (jest to poręczne w trybie "działania na sucho" - z ang. - "dry-run": spowoduje to konieczność udawania że wykonujesz polecenia które nie zadziałałyby gdyż źródła są brakujące, ale to nie ma znaczenia, gdyż tak na prawdę nie masz zamiaru ich uruchomić).

source: :mod:`distutils.dir_util` --- Directory tree operations
pl: :mod:`distutils.dir_util` --- operacje drzewa katalogowego

source: This module provides functions for operating on directories and trees of directories.
pl: Ten moduł dostarcza zadań dla operowania na katalogach i drzewach katalogowych.

source: Create a directory and any missing ancestor directories. If the directory already exists (or if *name* is the empty string, which means the current directory, which of course exists), then do nothing. Raise :exc:`DistutilsFileError` if unable to create some directory along the way (eg. some sub-path exists, but is a file rather than a directory). If *verbose* is true, print a one-line summary of each mkdir to stdout. Return the list of directories actually created.
pl: Utwórz katalog i wszystkie brakujące nadrzędne katalogi. Jeśli katalog już istnieje (lub jeśli *nazwa* pliku jest pustym ciągiem znaków, co oznacza aktualny katalog, który oczywiście istnieje), wtedy nie rób nic. Zgłoś :exc:`DistutilsFileError` jeśli nie było możliwe utworzenie jakiegoś katalogu po drodze (np. pewna podścieżka już istnieje ale jest raczej plikiem niż katalogiem). Jeśli *verbose* jest prawdą, wypisz jedno-wierszowe podsumowanie dla każdego mkdir ( - z ang. - polecenie stwórz katalog) na stdout ( - z ang. - standardowe wyjście). Zwróć listę katalogów właściwie utworzonych

source: Create all the empty directories under *base_dir* needed to put *files* there. *base_dir* is just the a name of a directory which doesn't necessarily exist yet; *files* is a list of filenames to be interpreted relative to *base_dir*. *base_dir* + the directory portion of every file in *files* will be created if it doesn't already exist. *mode*, *verbose* and *dry_run* flags are as for :func:`mkpath`.
pl: Utwórz wszystkie puste katalogi pod *base_dir* potrzebne do włożenia *plików* ( - z ang. - *files*) tam. *base_dir* jest tylko nazwą katalogu który jeszcze nie koniecznie istnieje; *pliki* ( z ang. - *files*) jest listą nazw plików do interpretacji względem *base_dir*. *base_dir* + porcja katalogu każdego pliku w *files* zostanie utworzona jeśli jeszcze nie istnieje. Flagi *mode*, *verbose* i *dry_run* działają tak, jak w :func:`mkpath`.

source: Copy an entire directory tree *src* to a new location *dst*. Both *src* and *dst* must be directory names. If *src* is not a directory, raise :exc:`DistutilsFileError`. If *dst* does not exist, it is created with :func:`mkpath`. The end result of the copy is that every file in *src* is copied to *dst*, and directories under *src* are recursively copied to *dst*. Return the list of files that were copied or might have been copied, using their output name. The return value is unaffected by *update* or *dry_run*: it is simply the list of all files under *src*, with the names changed to be under *dst*.
pl: Skopiuj całe drzewo katalogowe *src* do nowej lokacji *dst*. Zarówno *src* jak *dst* muszą być nazwami katalogów. Jeśli *src* nie jest katalogiem, zgłoś :exc:`DistutilsFileError`. Jeśli *dst* nie istnieje, jest tworzony za pomocą zadania :func:`mkpath`. Rezultat kopiowania jest taki że wszystkie pliki z *src* są kopiowane do *dst* a katalogi pod *src* są rekursywnie kopiowane do *dst*. Zwróć listę plików, które zostały skopiowane lub mogły być skopiowane, używając ich nazw wynikowych. Na Wartość zwracaną nie ma wpływu *update* ani *dry_run*: jest ona listą wszystkich plików pod *src*, z nazwami zmienionymi aby były pod *dst*.

source: *preserve_mode* and *preserve_times* are the same as for :func:`copy_file` in :mod:`distutils.file_util`; note that they only apply to regular files, not to directories. If *preserve_symlinks* is true, symlinks will be copied as symlinks (on platforms that support them!); otherwise (the default), the destination of the symlink will be copied. *update* and *verbose* are the same as for :func:`copy_file`.
pl: *preserve_mode* i *preserve_times* są takie same, jak dla zadania :func:`copy_file` w :mod:`distutils.file_util`; zauważ, że odnoszą się one tylko do zwykłych plików, nie do katalogów. Jeśli *preserve_symlinks* jest prawdziwe, symlinks zostanie skopiowane jako symlinks (na maszynach/środowiskach które wspierają je!); w przeciwnym przypadku (domyślnie), przeznaczenie symlinka zostanie skopiowane. *update* i *verbose* są takie same jak dla zadania :func:`copy_file`.

source: Recursively remove *directory* and all files and directories underneath it. Any errors are ignored (apart from being reported to ``sys.stdout`` if *verbose* is true).
pl: Wgłębnie usuwaj *katalog* i wszystkie pliki i katalogi pod nim się znajdujące. Jakiekolwiek błędy są ignorowane ( z wyjątkiem raportowania ich do ``sys.stdout``, jeśli flaga *verbose* ( - z ang. - "wymownie") jest prawdziwa.

source: **\*\*** Some of this could be replaced with the shutil module? **\*\***
pl: **\*\*** Część z tych rzeczy mogłoby być zamienione na moduł shutil? **\*\***

source: :mod:`distutils.file_util` --- Single file operations
pl: :mod:`distutils.file_util` --- Operacje na pojedynczym pliku.

source: This module contains some utility functions for operating on individual files.
pl: Ten moduł zawiera pewne użyteczne zadania dla operowania na pojedynczych plikach.

source: Copy file *src* to *dst*. If *dst* is a directory, then *src* is copied there with the same name; otherwise, it must be a filename. (If the file exists, it will be ruthlessly clobbered.) If *preserve_mode* is true (the default), the file's mode (type and permission bits, or whatever is analogous on the current platform) is copied. If *preserve_times* is true (the default), the last-modified and last-access times are copied as well. If *update* is true, *src* will only be copied if *dst* does not exist, or if *dst* does exist but is older than *src*.
pl: Kopiuj plik *src* do *dst*. Jeśli *dst* jest katalogiem, wtedy *src* jst kopiowany tam z tą samą nazwą; w przeciwnym przypadku, musi być nazwą pliku. (Jeśli plik istnieje, zostanie bezwzględnie podmieniony.) Jeśli *preserve_mode* (z ang. - tryb zachowywania) jest prawdziwy (domyślnie), tryb pliku (typ i bity praw dostępu lub cokolwiek jest analogicznego na obecnej maszynie/środowisku) jest kopiowane. Jeśli *preserve_times* jest prawdziwe (domyślnie), czasy ostatniej modyfikacji i ostatniego dostępu są kopiowane na równi. Jeśli *update* jest prawdziwe, *src* będzie kopiowane tylko jeśli *dst* nie istnieje, lub jeśli *dst* istnieje ale jest starsze niż *src*.
